app/controllers/api/v1/messages_controller.rb

      def new
        eleos_platform_key = 'Idontknowyet' #env variable once hosted on heroku
        if request.headers["Eleos-Platform-Key"] != eleos_platform_key
          render body: '401: Invalid Platform Key'
        else
          @message = Message.new(message_params)

          if @message.save!
---
INSERT INTO "messages" ("direction", "username", "message_type", "body", "composed_at", "platform_received_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"